"use client";

import React from "react";
import ServicesPageComp from "../../components/servicesPageComp/ServicesPageComp";

const data = [
    {
        id: 1,
        img: "/serv-1.jpg",
        head: "تجميل الاسنان",
        desc: `يهدف تبييض الأسنان إلى تبييض الطبقة الخارجية للأسنان
                            ،وهي تسمي مينا الأسنان. وهو إجراء غير جراحي يعمل علي
                            إعادة الأسنان إلي لونها الطبيعي من خلال إزالة
                            الصبغات الناتجة عن إصفرار الأسنان ويعتبر أقل تكلفة
                            من أي نوع أخر من العلاج التجميلي. من خلال تبييض
                            الأسنان في مراكز شايني وايت، تتخلص من تصبغ وبقع
                            الأسنان وتحصل علي شكل جمالي طبيعي
                            لإبتسامتك في خلال ساعات.`,
    },
    {
        id: 2,
        img: "/serv-2.jpg",
        head: "تجميل الاسنان",
        desc: `يهدف تبييض الأسنان إلى تبييض الطبقة الخارجية للأسنان
                            ،وهي تسمي مينا الأسنان. وهو إجراء غير جراحي يعمل علي
                            إعادة الأسنان إلي لونها الطبيعي من خلال إزالة
                            الصبغات الناتجة عن إصفرار الأسنان ويعتبر أقل تكلفة
                            من أي نوع أخر من العلاج التجميلي. من خلال تبييض
                            الأسنان في مراكز شايني وايت، تتخلص من تصبغ وبقع
                            الأسنان وتحصل علي شكل جمالي طبيعي
                            لإبتسامتك في خلال ساعات.`,
    },
    {
        id: 3,
        img: "/serv-3.jpg",
        head: "تجميل الاسنان",
        desc: `يهدف تبييض الأسنان إلى تبييض الطبقة الخارجية للأسنان
                            ،وهي تسمي مينا الأسنان. وهو إجراء غير جراحي يعمل علي
                            إعادة الأسنان إلي لونها الطبيعي من خلال إزالة
                            الصبغات الناتجة عن إصفرار الأسنان ويعتبر أقل تكلفة
                            من أي نوع أخر من العلاج التجميلي. من خلال تبييض
                            الأسنان في مراكز شايني وايت، تتخلص من تصبغ وبقع
                            الأسنان وتحصل علي شكل جمالي طبيعي
                            لإبتسامتك في خلال ساعات.`,
    },
    {
        id: 4,
        img: "/serv-4.jpg",
        head: "تجميل الاسنان",
        desc: `يهدف تبييض الأسنان إلى تبييض الطبقة الخارجية للأسنان
                            ،وهي تسمي مينا الأسنان. وهو إجراء غير جراحي يعمل علي
                            إعادة الأسنان إلي لونها الطبيعي من خلال إزالة
                            الصبغات الناتجة عن إصفرار الأسنان ويعتبر أقل تكلفة
                            من أي نوع أخر من العلاج التجميلي. من خلال تبييض
                            الأسنان في مراكز شايني وايت، تتخلص من تصبغ وبقع
                            الأسنان وتحصل علي شكل جمالي طبيعي
                            لإبتسامتك في خلال ساعات.`,
    },
    {
        id: 5,
        img: "/serv-5.jpg",
        head: "تجميل الاسنان",
        desc: `يهدف تبييض الأسنان إلى تبييض الطبقة الخارجية للأسنان
                            ،وهي تسمي مينا الأسنان. وهو إجراء غير جراحي يعمل علي
                            إعادة الأسنان إلي لونها الطبيعي من خلال إزالة
                            الصبغات الناتجة عن إصفرار الأسنان ويعتبر أقل تكلفة
                            من أي نوع أخر من العلاج التجميلي. من خلال تبييض
                            الأسنان في مراكز شايني وايت، تتخلص من تصبغ وبقع
                            الأسنان وتحصل علي شكل جمالي طبيعي
                            لإبتسامتك في خلال ساعات.`,
    },
    {
        id: 6,
        img: "/serv-6.jpg",
        head: "تجميل الاسنان",
        desc: `يهدف تبييض الأسنان إلى تبييض الطبقة الخارجية للأسنان
                            ،وهي تسمي مينا الأسنان. وهو إجراء غير جراحي يعمل علي
                            إعادة الأسنان إلي لونها الطبيعي من خلال إزالة
                            الصبغات الناتجة عن إصفرار الأسنان ويعتبر أقل تكلفة
                            من أي نوع أخر من العلاج التجميلي. من خلال تبييض
                            الأسنان في مراكز شايني وايت، تتخلص من تصبغ وبقع
                            الأسنان وتحصل علي شكل جمالي طبيعي
                            لإبتسامتك في خلال ساعات.`,
    },
];

const page = () => {
    return (
        <div className="max-w-[1380px] mx-auto px-[20px] lg:px-[30px] flex flex-col gap-[30px]">
            <h2 className="flex justify-center font-extrabold text-[60px] text-black/80 my-[50px]">
                الخدمات
            </h2>
            <div className="flex flex-col gap-[80px]" lang="ar" dir="rtl">
                {data.map((item) => {
                    return <ServicesPageComp key={item.id} {...item} />;
                })}
            </div>
        </div>
    );
};

export default page;
